pk={}

------------------------------------------------------------------------------------
-- pk
------------------------------------------------------------------------------------
function pk.dosomething1(n,l,w)
end
------------------------------------------------------------------------------------
------------------------------------------------------------------------------------
function pk.update()
	_tb={
		"如果你要和(.+)\\((\\w+)\\)性命相搏，请你也对这个人下一次 kill 指令。",
		"(.+)趁你不备, 悄然错步转身, 从背后出指突袭。",
		"(.+)对著你大喝一声：看招！",
		"(.+)诡笑中对着.+念了几句密咒，又伸手指了指"..me.charname.."。",
		"(.+)喝道：「你，我们的帐还没算完，看招！」",
		"(.+)和你一碰面，二话不说就打了起来",
		"(.+)可怜巴巴地向你慢慢走过来，伸出手，说道：",
		"(.+)手一扬，将.+对准你掷去",
		"(.+)突然诡异的一笑，单手一扬，拇指中指相扣，对准你的",
	}
	local  pk_triggerlist={
	       {name="pk_dosth1",regexp=linktri(_tb),script=function(n,l,w)    pk.dosomething1(n,l,w)  end,},
	}
	for k,v in pairs(pk_triggerlist) do
		addtri(v.name,v.regexp,"pk",v.script,v.line)
	end
	closeclass("pk")
end

pk.update()
