1.请在群文件下载 mush机器人安装说明.pdf 并照着安装
2.如果想要源代码自己写的，请在官方侠客行群文件里下载 Michen 2014.05.13号上传的 MUSHclient.rar
3.本机器人目前不开放代码，辛辛苦苦一行一行代码的从KISS的721 RBT转写过来的，完全是苦力活
4.以后会开放大部份的代码给大家自己可以微调适应一些BT的特殊需求
5.如果有遇到问题，请将LOGS目录下面的 script_error_log.txt 文件和 你的id-小时.log 两个文件发给我
  你的id-小时.log 这里要注意一下不要发错了，或者你把 你的id开头的文件都打包也行


7.21+VB控件，太占资源，一般人跑个五六个估计都有点累
5.55老是莫明奇妙的弹窗出错，或者直接就整个ZMUD没掉了
既然已经进入全民挂机时刻，就挂的彻底些吧
开一个mushclient可以挂10个ID完全无压力，如果你有足够多的ID要挂，就多开几个mushclient吧，他目前只能一个客户端挂10个


记得在Global Preferences中的Worlds里面加上你保存好的每个ID的MCL文件，这样你每次打开mushclient的时候
所有ID自动全部开好，全部自动开始，省时，省力，省心


目前版本的目标是先把KISS的功能全部实现
截止当前的1.2.2版本，实现了GB,DL,HS,QZ,WD的MP+FJ+CM+XINFA+FTB功能
(FTB的找路模块还是不太智能，找时间要重写，不过现阶段优先级比较低)
第二步的目标是整合QZWD,YB,以及自动配对组团去WAR